---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.VertexFormat
source: html/a946fa2b-bb1f-202c-38dc-8ae0307bedac.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexFormat

A specification of the format of vertex data contained in a piece of geometry.

## Syntax (C#)
```csharp
public class VertexFormat : IDisposable
```